** obtained from this query:
:PROPERTIES:
:ID:       09d78431-556f-4029-b603-ef4ebef082a5
:END:
#+begin_src python :session rdf :async yes :results output
  from rdflib import Graph, BNode, URIRef, Literal

  graph = Graph()

  graph.parse("/home/grotec/Repositories/ome-ld/static/core/owl/model.owl.ttl")

  query = """
  prefix owl: <http://www.w3.org/2002/07/owl#> 
  select distinct ?cls_name where {
    ?s a owl:Class .
  filter(contains(str(?s), "openmicroscopy"))
  bind(strafter(str(?s), "core/") as ?cls_name)
  }
  order by ?cls_name
  """

  results = graph.query(query)

  for row in results:
      print(row.cls_name)
#+end_src

#+RESULTS:
#+begin_example
AffineTransform
Annotation
Arc
ArcType
ArcType#Hg
ArcType#HgXe
ArcType#Other
ArcType#Xe
BasicAnnotation
BinData
BinDataCompression
BinDataCompression#bzip2
BinDataCompression#none
BinDataCompression#zlib
BinaryFile
BinaryOnly
Binning
Binning#1x1
Binning#2x2
Binning#4x4
Binning#8x8
Binning#Other
BooleanAnnotation
Channel
ChannelAcquisitionMode
ChannelAcquisitionMode#BrightField
ChannelAcquisitionMode#FSM
ChannelAcquisitionMode#FluorescenceCorrelationSpectroscopy
ChannelAcquisitionMode#FluorescenceLifetime
ChannelAcquisitionMode#LCM
ChannelAcquisitionMode#LaserScanningConfocalMicroscopy
ChannelAcquisitionMode#MultiPhotonMicroscopy
ChannelAcquisitionMode#NearFieldScanningOpticalMicroscopy
ChannelAcquisitionMode#Other
ChannelAcquisitionMode#PALM
ChannelAcquisitionMode#SPIM
ChannelAcquisitionMode#STED
ChannelAcquisitionMode#STORM
ChannelAcquisitionMode#SecondHarmonicGenerationImaging
ChannelAcquisitionMode#SingleMoleculeImaging
ChannelAcquisitionMode#SlitScanConfocal
ChannelAcquisitionMode#SpectralImaging
ChannelAcquisitionMode#SpinningDiskConfocal
ChannelAcquisitionMode#StructuredIllumination
ChannelAcquisitionMode#SweptFieldConfocal
ChannelAcquisitionMode#TIRF
ChannelAcquisitionMode#TotalInternalReflection
ChannelAcquisitionMode#WideField
ChannelContrastMethod
ChannelContrastMethod#Brightfield
ChannelContrastMethod#DIC
ChannelContrastMethod#Darkfield
ChannelContrastMethod#Fluorescence
ChannelContrastMethod#HoffmanModulation
ChannelContrastMethod#ObliqueIllumination
ChannelContrastMethod#Other
ChannelContrastMethod#Phase
ChannelContrastMethod#PolarizedLight
ChannelIlluminationType
ChannelIlluminationType#Epifluorescence
ChannelIlluminationType#NonLinear
ChannelIlluminationType#Oblique
ChannelIlluminationType#Other
ChannelIlluminationType#Transmitted
CommentAnnotation
Dataset
Detector
DetectorSettings
DetectorType
DetectorType#APD
DetectorType#AnalogVideo
DetectorType#CCD
DetectorType#CMOS
DetectorType#CorrelationSpectroscopy
DetectorType#EBCCD
DetectorType#EMCCD
DetectorType#FTIR
DetectorType#IntensifiedCCD
DetectorType#LifetimeImaging
DetectorType#Other
DetectorType#PMT
DetectorType#Photodiode
DetectorType#Spectroscopy
Dichroic
DoubleAnnotation
Ellipse
Experiment
ExperimentValue
ExperimentValue#Colocalization
ExperimentValue#Electrophysiology
ExperimentValue#FISH
ExperimentValue#FP
ExperimentValue#FRET
ExperimentValue#FluorescenceLifetime
ExperimentValue#FourDPlus
ExperimentValue#Immunocytochemistry
ExperimentValue#Immunofluorescence
ExperimentValue#IonImaging
ExperimentValue#Other
ExperimentValue#PGIDocumentation
ExperimentValue#Photobleaching
ExperimentValue#SPIM
ExperimentValue#Screen
ExperimentValue#SpectralImaging
ExperimentValue#TimeLapse
Experimenter
ExperimenterGroup
External
ExternalCompression
ExternalCompression#bzip2
ExternalCompression#none
ExternalCompression#zlib
Filament
FilamentType
FilamentType#Halogen
FilamentType#Incandescent
FilamentType#Other
FileAnnotation
Filter
FilterSet
FilterType
FilterType#BandPass
FilterType#Dichroic
FilterType#LongPass
FilterType#MultiPass
FilterType#NeutralDensity
FilterType#Other
FilterType#ShortPass
FilterType#Tuneable
Folder
GenericExcitationSource
HasId
HasName
Image
ImagingEnvironment
Instrument
Label
Laser
LaserLaserMedium
LaserLaserMedium#Ag
LaserLaserMedium#Alexandrite
LaserLaserMedium#Ar
LaserLaserMedium#ArCl
LaserLaserMedium#ArFl
LaserLaserMedium#CO
LaserLaserMedium#CO2
LaserLaserMedium#CoumarinC30
LaserLaserMedium#Cu
LaserLaserMedium#EMinus
LaserLaserMedium#ErGlass
LaserLaserMedium#ErYAG
LaserLaserMedium#GaAlAs
LaserLaserMedium#GaAs
LaserLaserMedium#H2O
LaserLaserMedium#HFl
LaserLaserMedium#HeCd
LaserLaserMedium#HeNe
LaserLaserMedium#HoYAG
LaserLaserMedium#HoYLF
LaserLaserMedium#Kr
LaserLaserMedium#KrCl
LaserLaserMedium#KrFl
LaserLaserMedium#N
LaserLaserMedium#NdGlass
LaserLaserMedium#NdYAG
LaserLaserMedium#Other
LaserLaserMedium#Rhodamine6G
LaserLaserMedium#Ruby
LaserLaserMedium#TiSapphire
LaserLaserMedium#Xe
LaserLaserMedium#XeBr
LaserLaserMedium#XeCl
LaserLaserMedium#XeFl
LaserPulse
LaserPulse#CW
LaserPulse#ModeLocked
LaserPulse#Other
LaserPulse#QSwitched
LaserPulse#Repetitive
LaserPulse#Single
LaserType
LaserType#Dye
LaserType#Excimer
LaserType#FreeElectron
LaserType#Gas
LaserType#MetalVapor
LaserType#Other
LaserType#Semiconductor
LaserType#SolidState
Leader
LightEmittingDiode
LightPath
LightSource
LightSourceSettings
Line
ListAnnotation
LongAnnotation
M
ManufacturerSpec
Map
MapAnnotation
Marker
Marker#Arrow
Mask
MetadataOnly
MicrobeamManipulation
MicrobeamManipulationValue
MicrobeamManipulationValue#FLIP
MicrobeamManipulationValue#FRAP
MicrobeamManipulationValue#InverseFRAP
MicrobeamManipulationValue#OpticalTrapping
MicrobeamManipulationValue#Other
MicrobeamManipulationValue#Photoablation
MicrobeamManipulationValue#Photoactivation
MicrobeamManipulationValue#Uncaging
Microscope
MicroscopeType
MicroscopeType#Dissection
MicroscopeType#Electrophysiology
MicroscopeType#Inverted
MicroscopeType#Other
MicroscopeType#Upright
NamingConvention
NamingConvention#letter
NamingConvention#number
NumericAnnotation
OME
Objective
ObjectiveCorrection
ObjectiveCorrection#Achro
ObjectiveCorrection#Achromat
ObjectiveCorrection#Apo
ObjectiveCorrection#Fl
ObjectiveCorrection#Fluar
ObjectiveCorrection#Fluor
ObjectiveCorrection#Fluotar
ObjectiveCorrection#Neofluar
ObjectiveCorrection#Other
ObjectiveCorrection#PlanApo
ObjectiveCorrection#PlanFluor
ObjectiveCorrection#PlanNeofluar
ObjectiveCorrection#SuperFluor
ObjectiveCorrection#UV
ObjectiveCorrection#VioletCorrected
ObjectiveImmersion
ObjectiveImmersion#Air
ObjectiveImmersion#Glycerol
ObjectiveImmersion#Multi
ObjectiveImmersion#Oil
ObjectiveImmersion#Other
ObjectiveImmersion#Water
ObjectiveImmersion#WaterDipping
ObjectiveSettings
ObjectiveSettingsMedium
ObjectiveSettingsMedium#Air
ObjectiveSettingsMedium#Glycerol
ObjectiveSettingsMedium#Oil
ObjectiveSettingsMedium#Other
ObjectiveSettingsMedium#Water
PixelType
PixelType#bit
PixelType#complex
PixelType#double
PixelType#double-complex
PixelType#float
PixelType#int16
PixelType#int32
PixelType#int8
PixelType#uint16
PixelType#uint32
PixelType#uint8
Pixels
PixelsDimensionOrder
PixelsDimensionOrder#XYCTZ
PixelsDimensionOrder#XYCZT
PixelsDimensionOrder#XYTCZ
PixelsDimensionOrder#XYTZC
PixelsDimensionOrder#XYZCT
PixelsDimensionOrder#XYZTC
Plane
Plate
PlateAcquisition
Point
Polygon
Polyline
Project
Pump
ROI
Reagent
Rectangle
Reference
Rights
Screen
Settings
Shape
ShapeFillRule
ShapeFillRule#EvenOdd
ShapeFillRule#NonZero
ShapeFontFamily
ShapeFontFamily#cursive
ShapeFontFamily#fantasy
ShapeFontFamily#monospace
ShapeFontFamily#sans-serif
ShapeFontFamily#serif
ShapeFontStyle
ShapeFontStyle#Bold
ShapeFontStyle#BoldItalic
ShapeFontStyle#Italic
ShapeFontStyle#Normal
StageLabel
StructuredAnnotations
TagAnnotation
TermAnnotation
TextAnnotation
TiffData
TimestampAnnotation
TransmittanceRange
TypeAnnotation
UUID
UnitsElectricPotential
UnitsElectricPotential#EV
UnitsElectricPotential#GV
UnitsElectricPotential#MV
UnitsElectricPotential#PV
UnitsElectricPotential#TV
UnitsElectricPotential#V
UnitsElectricPotential#YV
UnitsElectricPotential#ZV
UnitsElectricPotential#aV
UnitsElectricPotential#cV
UnitsElectricPotential#dV
UnitsElectricPotential#daV
UnitsElectricPotential#fV
UnitsElectricPotential#hV
UnitsElectricPotential#kV
UnitsElectricPotential#mV
UnitsElectricPotential#nV
UnitsElectricPotential#pV
UnitsElectricPotential#yV
UnitsElectricPotential#zV
UnitsElectricPotential#µV
UnitsFrequency
UnitsFrequency#EHz
UnitsFrequency#GHz
UnitsFrequency#Hz
UnitsFrequency#MHz
UnitsFrequency#PHz
UnitsFrequency#THz
UnitsFrequency#YHz
UnitsFrequency#ZHz
UnitsFrequency#aHz
UnitsFrequency#cHz
UnitsFrequency#dHz
UnitsFrequency#daHz
UnitsFrequency#fHz
UnitsFrequency#hHz
UnitsFrequency#kHz
UnitsFrequency#mHz
UnitsFrequency#nHz
UnitsFrequency#pHz
UnitsFrequency#yHz
UnitsFrequency#zHz
UnitsFrequency#µHz
UnitsLength
UnitsLength#Em
UnitsLength#Gm
UnitsLength#Mm
UnitsLength#Pm
UnitsLength#Tm
UnitsLength#Ym
UnitsLength#Zm
UnitsLength#am
UnitsLength#cm
UnitsLength#dam
UnitsLength#dm
UnitsLength#fm
UnitsLength#ft
UnitsLength#hm
UnitsLength#in
UnitsLength#km
UnitsLength#li
UnitsLength#ly
UnitsLength#m
UnitsLength#mi
UnitsLength#mm
UnitsLength#nm
UnitsLength#pc
UnitsLength#pixel
UnitsLength#pm
UnitsLength#pt
UnitsLength#reference+frame
UnitsLength#thou
UnitsLength#ua
UnitsLength#yd
UnitsLength#ym
UnitsLength#zm
UnitsLength#µm
UnitsLength#Å
UnitsPower
UnitsPower#EW
UnitsPower#GW
UnitsPower#MW
UnitsPower#PW
UnitsPower#TW
UnitsPower#W
UnitsPower#YW
UnitsPower#ZW
UnitsPower#aW
UnitsPower#cW
UnitsPower#dW
UnitsPower#daW
UnitsPower#fW
UnitsPower#hW
UnitsPower#kW
UnitsPower#mW
UnitsPower#nW
UnitsPower#pW
UnitsPower#yW
UnitsPower#zW
UnitsPower#µW
UnitsPressure
UnitsPressure#EPa
UnitsPressure#GPa
UnitsPressure#MPa
UnitsPressure#Mbar
UnitsPressure#PPa
UnitsPressure#Pa
UnitsPressure#TPa
UnitsPressure#Torr
UnitsPressure#YPa
UnitsPressure#ZPa
UnitsPressure#aPa
UnitsPressure#atm
UnitsPressure#bar
UnitsPressure#cPa
UnitsPressure#cbar
UnitsPressure#dPa
UnitsPressure#daPa
UnitsPressure#dbar
UnitsPressure#fPa
UnitsPressure#hPa
UnitsPressure#kPa
UnitsPressure#kbar
UnitsPressure#mPa
UnitsPressure#mTorr
UnitsPressure#mbar
UnitsPressure#mm+Hg
UnitsPressure#nPa
UnitsPressure#pPa
UnitsPressure#psi
UnitsPressure#yPa
UnitsPressure#zPa
UnitsPressure#µPa
UnitsTemperature
UnitsTemperature#K
UnitsTemperature#°C
UnitsTemperature#°F
UnitsTemperature#°R
UnitsTime
UnitsTime#Es
UnitsTime#Gs
UnitsTime#Ms
UnitsTime#Ps
UnitsTime#Ts
UnitsTime#Ys
UnitsTime#Zs
UnitsTime#as
UnitsTime#cs
UnitsTime#d
UnitsTime#das
UnitsTime#ds
UnitsTime#fs
UnitsTime#h
UnitsTime#hs
UnitsTime#ks
UnitsTime#min
UnitsTime#ms
UnitsTime#ns
UnitsTime#ps
UnitsTime#s
UnitsTime#ys
UnitsTime#zs
UnitsTime#µs
Value
Well
WellSample
XMLAnnotation
#+end_example
